# WallArea_Gross

## Description
Returns the 2D gross surface area of walls that meet the criteria.

```pascal
FUNCTION WallArea_Gross(c : CRITERIA): REAL;
```

```python
def vs.WallArea_Gross(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|   |

## Version
Availability: from Vectorworks14.0

## Category
* Criteria